#+title: Paradigms of Artificial Intelligence Programming Notes

*** NOTES
Just the basics. If you did Touretzky's book, you don't really need to read it.

Norvig seems to prefer ~FIRST~, ~LAST~, etc. over ~CAR~ and ~CDR~. [[https://www.xach.com/naggum/articles/3092837184154309@naggum.no.html][According to Erik Naggum]], the ~LIST~ abstraction is designed to be different from the ~CONS~ abstraction, and as such, it seems ~FIRST~, ~LAST~, etc. are specific to the ~LIST~ abstraction

One thing I didn't notice while completing Touretzky's book: ~FIRST~, ~SECOND~, etc. return an atom, but ~LAST~ returns a list. ~LAST~ can return n items at the end of a list.

#+begin_src lisp
(last '(five four (three two) one))
(last '(five four (three two) one) 2)
#+end_src

#+RESULTS:
| (THREE TWO) | ONE |

**** Complex
#+begin_src lisp
;;; Rules:
;; Sentence => Noun-Phrase + Verb-Phrase
;; Noun-Phrase => Article + Noun
;; Verb-Phrase => Verb + Noun-Phrase
;; Article => the, a, ...
;; Noun => man, ball, woman, table...
;; Verb => hit, took, saw, liked...

;; The complex approach
;; Why is this complex?
;;; 1. The code is more complex than the rules as defined in natural language.
;;; 2. Adding new rules requires an understanding of Common Lisp semantics.
;;; You need conditionals, you need to understand DEFUN, parameter lists, APPEND, etc.

(defun sentence ()    (append (noun-phrase) (verb-phrase)))
(defun noun-phrase () (append (Article) (Noun)))
(defun verb-phrase () (append (Verb) (noun-phrase)))
(defun Article ()     (one-of '(the a)))
(defun Noun ()        (one-of '(man ball woman table)))
(defun Verb ()        (one-of '(hit took saw liked)))


(defun one-of (set)
  "Pick one element of set, and make a list of it."
  (list (random-elt set)))

(defun random-elt (choices)
  "choose an element from a list at random."
  (elt choices (random (length choices))))

(defun Adj* ()
  (if (= (random 2) 0)
      nil
      (append (Adj) (Adj*))))

(defun PP* ()
  (if (random-elt '(t nil))
      (append (PP) (PP*))
      nil))

;;; What if you don't want to use conditionals, but rely on the data-type itself?
;;; With the complex code, can't.
;; (defun Adj* ()
;;   "Warning - incorrect definition of Adjectives."
;;   (one-of '(nil (append (Adj) (Adj*))))
;;   )
                                        ; returns '(nil (append (Adj) (Adj*)))
;; (defun Adj* ()
;;   "Warning - incorrect definition of Adjectives."
;;   (one-of (list nil (append (Adj) (Adj*))))
;;   )
                                        ; infinite loop

;; Code complexity will continue to increase as more grammar rules are added. Lisp knowledge necessary for creating rules. Original code will also need to be modified to add more rules.

;; NOUN-PHRASE modified to account for optional adj and pp
(defun noun-phrase () (append (Article) (Adj*) (Noun) (PP*)))
(defun PP () (append (Prep) (noun-phrase)))
(defun Adj () (one-of '(big little blue green adiabatic)))
(defun Prep () (one-of '(to in by with on)))

(sentence)
#+end_src

#+RESULTS:
| THE | BLUE | LITTLE | BALL | BY | A | GREEN | BLUE | MAN | TOOK | THE | BIG | MAN | IN | A | TABLE |

*** NOTES
:LOGBOOK:
CLOCK: [2024-09-15 Sun 14:48]--[2024-09-15 Sun 15:59] =>  1:11
CLOCK: [2024-09-15 Sun 07:46]--[2024-09-15 Sun 12:19] =>  4:33
:END:
**** Exercise 3.1 [m] Show a lambda expression that is equivalent to the above let* expression. You may need more than one lambda.
#+begin_src lisp
(let* ((x 6)
       (y (* x x)))
  (+ x y))

(funcall (lambda (a b) (+ a b))
         6
         (funcall (lambda (y) (* y y)) 6))
#+end_src

#+RESULTS:
: 42

**** Exercise 3.6 [s] Given the following initialization for the lexical variable a and the special variable *b*, what will be the value of the let form?
#+begin_src lisp
(setf a 'global-a)
(defvar *b* 'global-b)

(defun fn () *b*)

(let ((a 'local-a)
      (*b* 'local-b))
  (list a *b* (fn) (symbol-value 'a) (symbol-value '*b*)))
#+end_src

#+RESULTS:
| LOCAL-A | LOCAL-B | LOCAL-B | GLOBAL-A | LOCAL-B |

*** NOTES
:LOGBOOK:
CLOCK: [2024-09-16 Mon 17:01]--[2024-09-17 Tue 13:59] => 20:58
:END:

